import numpy as np



# Дан случайный массив, поменять знак у элементов, значения которых между 3 и 8
# arr_random = np.arange(1, 16)
# print(arr_random)
# arr_random[(3 < arr_random) & (arr_random < 8)] *= -1
# print(arr_random)

# Заменить максимальный элемент случайного массива на 0
# arr_random = np.arange(30)
# print(arr_random)
# arr_random[arr_random.argmax()] = 0
# print(arr_random)

# Построить прямое произведение массивов (все комбинации с каждым элементом). На вход подается двумерный массив
arr = np.empty((4, 6, 3), dtype='int32')
print(arr)


